<template>
  <div>
    <h3>Раздел “О задании”</h3>
    <p>В разделе должен быть текст этого задания, сверстанный аналогично.</p>
    <h3>Раздел “Карта”</h3>
    <p>На экране должны быть карта и список (см пример):</p>
    <ol>
      <li>При клике на кнопку добавления, карта должна перейти в режим добавления
        маркера: в месте клика должен появится маркер, а в списке - запись с адресом точки

        Для поиска адреса можно использовать любое бесплатное API для геокодирования,
        например: https://geocode.maps.co/

        В случае, если адрес не найден, необходимо вывести ошибку и не добавлять маркер в
        список.
      </li>
      <li>При клике на маркер должна подсвечиваться запись в списке</li>
      <li>При клике на запись в списке карта должна центрироваться на маркере</li>
      <li>Маркеры должны храниться локально и не пропадать после перезагрузки страницы
      </li>
      <li>В адресной строке должен отображаться id выбранного маркера</li>
    </ol>
    <p>Локальное хранение данных должно быть организовано в виде сервиса, эмулирующего
      бекенд. (Необходим класс Backend, который псевдо-асинхронно сохраняет данные в
      localStorage)</p>
    <p>Дополнительно:</p>
    <ol>
      <li>Продумать отображение на мобильных устройствах</li>
      <li>Предусмотреть локализацию</li>
      <li>Необходимо с помощью jest написть 1 модульный тест на любой компонент</li>
    </ol>
    <p>Напоминание: тестовое задание призвано показать умение писать хороший модульный
      код,
      а также умение пользоваться указанными технологиями и не только. Этим кодом нужно
      гордиться.</p>
  </div>
</template>

<script>
export default {
  name: 'Task'
}
</script>

<style scoped>

</style>
